from sqlalchemy import false


a = '''
[0][0][0][0][0][0][0][0][0][0][0][0]
[■][ ][ ][ ][0][ ][ ][ ][0][0][0][0]
[0][0][0][ ][ ][ ][0][ ][ ][ ][ ][0]
[0][0][0][ ][0][ ][0][0][0][0][ ][0]
[0][ ][ ][ ][0][ ][0][0][0][0][ ][0]
[0][ ][0][ ][0][0][0][0][0][0][ ][0]
[0][ ][0][ ][0][ ][0][0][0][0][ ][0]
[0][ ][0][ ][ ][ ][0][0][0][0][ ][0]
[0][ ][0][0][0][ ][ ][ ][ ][0][ ][0]
[0][ ][0][0][0][0][ ][0][0][0][ ][0]
[0][ ][ ][0][0][ ][ ][ ][0][ ][ ][0]
[0][0][ ][ ][ ][0][0][ ][0][ ][0][0]
[0][0][ ][0][0][0][0][ ][0][0][0][0]
[0][0][ ][0][ ][ ][0][ ][0][ ][0][0]
[0][0][ ][ ][0][ ][ ][ ][0][ ][ ][▲]
[0][0][0][0][0][0][0][ ][ ][ ][0][0]
[0][0][0][0][0][0][0][0][0][0][0][0]
'''
# b = list(a)
# b[39] = " "
# b[42] = "■"
# a = ''.join(b)
print(a.find("f"))
print(a)
while 1:
    my = a.find('■') #현 위치
    move = input('방향입력(wasd) : ')
    if move == 'w': #위-37
        b = list(a)        
        if b[my-37] == '0':
            print('거긴 벽이에요..')
        elif b[my-37] == '▲':
            b[my] = " "
            b[my-37] = "■"
            a = ''.join(b)
            print(a)
            print("탈출~!~!~~!")
            break
        else:
            b[my] = " "
            b[my-37] = "■"
            a = ''.join(b)
            print(a)
    elif move == 'a': #왼-3
        b = list(a)
        if b[my-3] == "0":
            print("거긴 벽이에요..")
        elif b[my-3] == b[36]:
            print('그건 반칙이에요..')
        elif b[my-3] == '▲':
            b[my] = " "
            b[my-3] = "■"
            a = ''.join(b)
            print(a)
            print("탈출~!~!~~!")
            break
        else:
            b[my] = " "
            b[my-3] = "■"
            a = ''.join(b)
            print(a)
    elif move == 's': #아래+37
        b = list(a)
        if b[my+37] == '0':
            print("b[my+3]:",b[my+3])
            print('거긴 벽이에요..')
        elif b[my+37] == '▲':
            b[my] = " "
            b[my+37] = "■"
            a = ''.join(b)
            print(a)
            print("탈출~!~!~~!")
            break
        else:
            b[my] = " "
            b[my+37] = "■"
            a = ''.join(b)
            print(a)
    elif move == 'd': #오+3
        b = list(a)
        if b[my+3] == "0":
            print("거긴 벽이에요..")
        elif b[my+3] == '▲':
            b[my] = " "
            b[my+3] = "■"
            a = ''.join(b)
            print(a)
            print("탈출~!~!~~!")
            break
        else:
            b[my] = " "
            b[my+3] = "■"
            a = ''.join(b)
            print(a)

